#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
aws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=hc5yzh4uka]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_dynamodb_table.urls: Refreshing state... [id=urls]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_api_gateway_resource.redirect_resource: Refreshing state... [id=9fgzxp]
module.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-hc5yzh4uka-nh1ykpwsj5-POST]
data.aws_iam_policy_document.create_short_url_lambda: Reading...
data.aws_iam_policy_document.allow_get_url_lambda: Reading...
data.aws_iam_policy_document.create_short_url_lambda: Read complete after 0s [id=2348542042]
data.aws_iam_policy_document.allow_get_url_lambda: Read complete after 0s [id=2816463254]
module.redirect_lambda.data.aws_iam_policy_document.policies: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Reading...
module.redirect_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=4168244811]
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=1299851198]
module.create_short_url_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=create-short-url--lambda-lambda-role]
module.redirect_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=redirect--lambda-lambda-role]
module.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-hc5yzh4uka-9fgzxp-GET]
module.redirect_lambda.aws_lambda_function.lambda: Refreshing state... [id=redirect--lambda]
module.create_short_url_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-short-url--lambda]
module.redirect_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-hc5yzh4uka-9fgzxp-GET]
module.post_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.post_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-hc5yzh4uka-nh1ykpwsj5-POST]
module.redirect_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.url_shortener_api_deployment: Refreshing state... [id=x1xmar]
aws_api_gateway_stage.live: Refreshing state... [id=ags-hc5yzh4uka-live]
aws_api_gateway_usage_plan.usage: Refreshing state... [id=3cusni]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.create_short_url_lambda.aws_lambda_function.lambda has been deleted
  - resource "aws_lambda_function" "lambda" {
      - arn                            = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda" -> null
      - function_name                  = "create-short-url--lambda" -> null
        id                             = "create-short-url--lambda"
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda/invocations" -> null
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.redirect_lambda.aws_lambda_function.lambda has been deleted
  - resource "aws_lambda_function" "lambda" {
      - arn                            = "arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda" -> null
      - function_name                  = "redirect--lambda" -> null
        id                             = "redirect--lambda"
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda/invocations" -> null
        tags                           = {}
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/create-short-url--lambda-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-24T22:36:57Z" -> (known after apply)
      ~ id                    = "create-short-url--lambda-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "create-short-url--lambda-lambda-role" -> "create-short-url--lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT4523PSIZCQM" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.create_short_url_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "create-short-url-_lambda_function_payload.zip"
      + function_name                  = "create-short-url-"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BASE_URL" = "https://yr9q6b5bjc.execute-api.us-east-1.amazonaws.com/live/"
            }
        }
    }

  # module.post_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-hc5yzh4uka-nh1ykpwsj5-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.post_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "create-short-url-"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:692735942459:hc5yzh4uka/*/POST/"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/redirect--lambda-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-24T22:36:57Z" -> (known after apply)
      ~ id                    = "redirect--lambda-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "redirect--lambda-lambda-role" -> "redirect--lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45UK544XTU4" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "redirect-_lambda_function_payload.zip"
      + function_name                  = "redirect-"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-hc5yzh4uka-9fgzxp-GET"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "redirect-"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:692735942459:hc5yzh4uka/*/GET/{redirectCode}"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 6 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*